Revit 2024 API
ParameterTypeId.BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled Property
 "Segment Bends"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled { get; }
Visual Basic
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsForSegmentsEnabled {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace